shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app.c
	os_err = OSTaskCreateExt((void (*)(void *))passTask, // 정상체온인 사람은 통과를 허가하는 Task
							 (void *)0,
							 (OS_STK *)&passTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_PASS_PRIO,
							 (INT16U)TASK_PASS_PRIO,
							 (OS_STK *)&passTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))denyTask, // 비정상체온인 사람은 통과를 불허하는 Task
							 (void *)0,
							 (OS_STK *)&denyTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_DENY_PRIO,
							 (INT16U)TASK_DENY_PRIO,
							 (OS_STK *)&denyTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))checkTask, // 알림 장치 작동 중지하는 Task
							 (void *)0,
							 (OS_STK *)&checkTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_CHECK_PRIO,
							 (INT16U)TASK_CHECK_PRIO,
							 (OS_STK *)&checkTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

#if (OS_TASK_NAME_SIZE >= 11)
	OSTaskNameSet(TASK_DETECT_PRIO, (CPU_INT08U *)"Detect Task", &os_err);
	OSTaskNameSet(TASK_TEMPER_PRIO, (CPU_INT08U *)"Temperature Task", &os_err);
	OSTaskNameSet(TASK_PASS_PRIO, (CPU_INT08U *)"Pass Task", &os_err);
	OSTaskNameSet(TASK_DENY_PRIO, (CPU_INT08U *)"Deny Task", &os_err);
	OSTaskNameSet(TASK_CHECK_PRIO, (CPU_INT08U *)"Check Task", &os_err);
#endif

	OSStart(); /* Start multitasking (i.e. give control to uC/OS-II).  */

	//	BSP_Init();
	//	OS_CPU_SysTickInit();
	//#if (OS_TASK_STAT_EN > 0)
	//	OSStatInit(); /* Determine CPU capacity.                              */
	//#endif
	//
	//#if ((APP_PROBE_COM_EN == DEF_ENABLED) || \
//	 (APP_OS_PROBE_EN == DEF_ENABLED))
	//	App_InitProbe();
	//#endif

	return (0);
}

/*
 *********************************************************************************************************
 *                                          detectTask()
 *
 * Description : Human detecting task. Monitor the existence of people,
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

// Task가 수행할 함수, 사람의 존재 유/무를 알려주는 Task
static void detectTask(void *p)
{
	CPU_INT08U err;

	BSP_Init();
	OS_CPU_SysTickInit();
#if (OS_TASK_STAT_EN > 0)
	OSStatInit(); /* Determine CPU capacity.                              */
#endif

#if ((APP_PROBE_COM_EN == DEF_ENABLED) || \
	 (APP_OS_PROBE_EN == DEF_ENABLED))
	App_InitProbe();
#endif

	while (DEF_TRUE)
	{
		ADC_SoftwareStartConvCmd(ADC1, ENABLE);

		while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
			;

		ADC_value = ADC_GetConversionValue(ADC1);

		if (ADC_value != 0) // when human detected
		{
			BSP_LED_On(3);
			OSFlagPost(flagGroup, FLAG_DETECT, OS_FLAG_SET, &err);
		}
		else
		{
			BSP_LED_Off(3);
			OSFlagPost(flagGroup, FLAG_DETECT_NOT, OS_FLAG_SET, &err);
		}
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            temperTask()
 *
 * Description : Measure a person's temperature
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
void i2c_multi_read(int Device_Addr, int Reg, int *pBuffer, int NumByteToRead);
// 사람의 온도를 측정하여 통과할지 말지를 결정하는 Task
static void temperTask(void *p)
{
	INT8U err;
	int temp;
	int high = 39;
	int low = 34;
	while (DEF_TRUE)
	{
		//temp = readTemperature();
		i2c_multi_read(0x74, 0xfa, &temp, 1); //
		BSP_LED_On(4);
		if (temp > high) // when temperature is HIGH
		{
			//OSQPost(temperQue, temp);
			//BSP_LED_On(2);
			//BSP_LED_Off(3);
			OSFlagPost(flagGroup, FLAG_TEMPER_HIGH, OS_FLAG_SET, &err);
		}
		else if (temp < low)
		{
			//OSQPost(temperQue, temp);
			//BSP_LED_On(2);
			//BSP_LED_Off(3);
			OSFlagPost(flagGroup, FLAG_TEMPER_LOW, OS_FLAG_SET, &err);
		}
		else
		{
			//BSP_LED_On(3);
			//BSP_LED_Off(2);
			OSFlagPost(flagGroup, FLAG_TEMPER_NORMAL, OS_FLAG_SET, &err);
		}

		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}
void i2c_multi_read(int Device_Addr, int Reg, int *pBuffer, int NumByteToRead)

{

	/* While the bus is busy */

	while (I2C_GetFlagStatus(((I2C_TypeDef *)I2C1_BASE), I2C_FLAG_BUSY))
		;

	/* Send START condition */

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/* Test on EV5 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for write */

	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), Device_Addr, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		;

	/* Send the device internal address to read from: Only one byte address */

	I2C_SendData(((I2C_TypeDef *)I2C1_BASE), Reg);

	/* Test on EV8 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		;

	/* Send STOP condition */

	I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/********************************/

	/* Send STRAT condition a second time */

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/* Test on EV5 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send device address for read */

	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), Device_Addr, I2C_Direction_Receiver);

	/* Test on EV6 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
		;

	/* While there is data to be read */

	while (NumByteToRead)

	{

		if (NumByteToRead == 1)

		{

			/* Disable Acknowledgement */

			I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), DISABLE);

			/* Send STOP Condition */

