shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app.c
			I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);
		}

		while ((I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE)) & 0x0040) != 0x000040)
			; /* Poll on RxNE */

		/* Read a byte from the EEPROM */

		*pBuffer = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));

		/* Point to the next location where the byte read will be saved */

		pBuffer++;

		/* Decrement the read bytes counter */

		NumByteToRead--;
	}

	/* Enable Acknowledgement to be ready for another reception */

	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);
}

static int readTemperature()
{
	int state = 0;
	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);
	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), 0x74, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));

	I2C_SendData(((I2C_TypeDef *)I2C1_BASE), 0x07);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));
	//I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE); // check

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);
	//while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
	//	; // check
	//I2C_SendData(I2C1, 0x75);
	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), 0x75, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));

	int low = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));
	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	int high = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));
	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	int pec = I2C_GetPEC(((I2C_TypeDef *)I2C1_BASE));
	I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	if (high & 0x80 != 0)
	{
		return -1;
	}
	else
	{
		return (high << 8 + low) * 0.02 - 273.15;
	}
}

/*
 *********************************************************************************************************
 *                                            passTask()
 *
 * Description : Those who are at normal body temperature are allowed to pass.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// 정상체온인 사람은 통과를 허가하는 Task
static void passTask(void *p)
{
	int err;
	while (DEF_TRUE)
	{
		OSFlagPend(flagGroup, FLAG_DETECT + FLAG_TEMPER_NORMAL, OS_FLAG_WAIT_SET_ALL + OS_FLAG_CONSUME, 0, (INT8U *)&err);
		// dot-matrix
		// TODO("dot-matrix pass");
		// piezo
		GPIO_SetBits(GPIOB, GPIO_Pin_8);
		// door
		for (int i = TIM2->CCR1; i < 2300; i += 2) // 1500 -> 2300
		{
			TIM2->CCR1 = i;
		}

		// stop setting
		OSSemPend(sem, 0, (INT8U *)&err);
		count = 1;
		OSSemPost(sem);
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            denyTask()
 *
 * Description : People with abnormal body temperature are not allowed to pass through.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// 비정상체온인 사람은 통과를 불허하는 Task
static void denyTask(void *p)
{
	int err;
	int temp = 0;
	while (DEF_TRUE)
	{
		int flags =
			OSFlagPend(flagGroup,
					   FLAG_TEMPER_HIGH + FLAG_TEMPER_LOW + FLAG_DETECT_NOT,
					   OS_FLAG_WAIT_SET_ANY + OS_FLAG_CONSUME,
					   0,
					   (INT8U *)&err);
		if ((flags & FLAG_TEMPER_HIGH) != 0)
		{
			// dot-matrix
			// TODO("dot-matrix deny"); X
			// piezo
			GPIO_SetBits(GPIOB, GPIO_Pin_8);
		}
		else if ((flags & FLAG_TEMPER_LOW) + (flags & FLAG_DETECT_NOT) == 0)
		{
			// dot-matrix
			// TODO("dot-matrix stay"); --
			// piezo
			GPIO_SetBits(GPIOB, GPIO_Pin_8);
		}
		OSSemPend(sem, 0, (INT8U *)&err);
		count = 1;
		OSSemPost(sem);
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            checkTask()
 *
 * Description : Check dot-matrix, piezo, motor.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// dot-matrix, piezo, motor를 1초 후 정지하도록 하는 Task
static void checkTask(void *p)
{
	CPU_INT08U err;
	int isStop = 0;
	while (DEF_TRUE)
	{
		if (count != 0)
		{
			OSSemPend(sem, 0, &err);
			if (count > TIME_COUNT)
			{
				isStop = 1; // Use flag / Don't do a lot of work in sem
				count = 0;	// init time counter
			}
			count++;
			OSSemPost(sem);

			// STOP: Do out of sem
			if (isStop == 1)
			{
				stopAll();
				isStop = 0;
			}
		}

		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

// Stop all
static void stopAll()
{
	// dot-matrix

	// piezo
	GPIO_ResetBits(GPIOB, GPIO_Pin_8);
	// motor
	for (int i = TIM2->CCR1; i > 1500; i -= 2) // 2300 -> 1500
	{
		TIM2->CCR1 = i;
	}
}
/*
 *********************************************************************************************************
 *                                          App_DispScr_SignOn()
 *
 * Description : Display uC/OS-II system information on the LCD.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : TaskUserIF().
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

static void App_DispScr_SignOn(void)
{
}

/*
 *********************************************************************************************************
 *                                          App_DispScr_SignOn()
 *
 * Description : Display uC/OS-II system information on the LCD.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : TaskUserIF().
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

static void App_DispScr_TaskNames(void)
{
}

